app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["user_id", 9], ["created_at", "2015-12-21 21:21:22.968647"], ["updated_at", "2015-12-21 21:21:22.968647"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)