app/controllers/relationships_controller.rb

    def create
        user = User.find(params[:followed_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 9]]

    def destroy
        user = Relationship.find(params[:id]).followed
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", 1]]